[
{
"npc_id":0,
"texts":["What, someone from the capital came? I thought you forgot abot your damn duties.",
"Look, I'm sorry for what I've said earlier. Just get this thing over with and you can move on with your life.",
"Oh, nothing, it's just that we requestsed aid from the capital yesterday and it took you one whole day to come.",
"Our crop fields have been overrun with these weird *things* and everyone is getting sick whenever they go out in the fields.We can't really tell why but that's where you come in. Just clear the fields...please.",
"Thank god. You're a life saver. I know this was just another chore for you, but I really wanted to say I appreciate what you've done for us. Also, here's your reward. Farewell!",
"Hey, it's you again. How's it going, hero?"],
"answers":[[{"text":"So what do you want me to do?","stage":3,"close":false},{"text":"How about I came back later when you dropped the attitude?","stage":1,"close":true},{"text":"Did something happen?","stage":2,"close":false}],
[{"text":"So what do you want me to do?","stage":3,"close":false},{"text":"Next time, try with 'please' and 'thank you'.","stage":1,"close":true},{"text":"Did something happen?","stage":2,"close":false}],
[{"text":"I don't see how that's my fault though.","stage":1,"close":false}],
[{"text":"Getting sick? Sounds like they're just cowards to me.","stage":3,"close":true}],
[{"text":"Eh, I had fun myself.","stage":5,"close":true},{"text":"Glad to see you're relieved.","stage":5,"close":true},{"text":"Whatever.","stage":5,"close":true}],
[{"text":"I'm good, thanks.","stage":5,"close":true}]
],
"max_stage":5
},
{
"npc_id":1,
"texts":["Hey, can you come over here for a second?",
"Please, someone very special to me might be in grave danger. I'm begging you.",
"We don't know why yet, but the mist that took over Khali is making everyone sick. But it looks like it didn't affect you, so please, help an old man out.",
"It's about my daughter, Claire. She was supposed to be home by now. She went picnicking yesterday to clear her mind but since then the monsters appeared. I am really, really concerned. Please, look out for her."
],
"answers":[[{"text":"Sure, what will it be?","stage":3,"close":false},{"text":"I'm sorry pops, I'm busy. Royal army stuff.","stage":1,"close":true},{"text":"Are you feeling well? You don't look too good.","stage":2,"close":false}],
[{"text":"I guess I could help then","stage":3,"close":false},{"text":"I'm sure she's just waiting for the fog to clear out. What can go wrong with a little picnic?","stage":1,"close":true},{"text":"What happened to you again?","stage":2,"close":false}],
[{"text":"Oh...","stage":1,"close":false}],
[{"text":"I'll keep an eye out, go rest for a bit.","stage":3,"close":true}]
],
"max_stage":3
},
{
"npc_id":2,
"texts":["Oh god, please don't hurt me. It wasn't me,I swear...",
"It's you again! You won't fool me as well. LEAVE ME ALONE!",
"The nightmares, oh god the nightmares! They were unbearable. This beast killed me slowly so many times.SO MANY TIMES!!!",
"AND IT HURT AS MUCH EVERYTIME SHE DID IT! I don't want to go home. My dad, he is already reborn after dying in his dreams. I DON'T WANNA BE REBORN!",
"I AM IN NO WAY GOING HOME. I am only safe beyond the Mist. I am not crazy... I know I am not crazy..."
],
"answers":[[{"text":"What the hell are you talking about?","stage":2,"close":false},{"text":"Whatever.","stage":1,"close":true},{"text":"Are you Claire? Just come with me, everything will be alright.","stage":4,"close":false}],
[{"text":"What are you talking about?","stage":2,"close":false},{"text":"Maybe I'll come back when you are less of a lunatic.","stage":1,"close":true},{"text":"Just come with me, we'll get home in no time.","stage":4,"close":false}],
[{"text":"...","stage":4,"close":false}],
[{"text":"I understand nothing and frankly this is well above my paygrade. Just come home with me, you'll sort it out with your dad.","stage":4,"close":false}],
[{"text":"The Mist? The 'poisonous fog' everyone is crying about? I have no time for this, I'll carry you home myself if I have to.","stage":4,"close":true}]
],
"max_stage":4
},
{
"npc_id":1,
"texts":["Oh thank the gods you brought her back, my little angel. I was so scared.",
"She said what? I'm afraid these matters concern the locals only, but I guess it won't hurt if I told you, since you've done so much for us.",
"Truth is, this island is inhabited by a goddess, and everyone being born here has a part of the god's soul residing within theirs. Rebirthing is when you learn to love that part within you, and understand that all it desires is to protect you.",
"She said what? Maybe she was just scared of 'rebirthing' and was in denial. I bet she was blabbering a lot of crazy stuff, wasn't she?",
"So, since my daughter is very sick from that weird fog  that appeared, can I ask you for even more help? I hope this doesn't make you feel bad or used. Claire really needs your help.",
"I need you to meet a woman. Her name is Fraya, he lives in a hut in the woods near the cemetery, but you can probably find her at the cemetery. Can you tell her I said 'The dove broke its wings'? She'll know what it means."
],
"answers":[[{"text":"She put up quite a fight though. Care to explain what 'Rebirthing in your dreams' mean?","stage":1,"close":false},{"text":"No problem.","stage":4,"close":false}],
[{"text":"...","stage":2,"close":false}],
[{"text":"She also mentioned something about you being killed by a beast in her dreams. What was that all about?","stage":3,"close":false}],
[{"text":"I guess she...was...","stage":4,"close":false}],
[{"text":"I guess I can.","stage":5,"close":false},{"text":"Maybe later.","stage":4,"close":true}],
[{"text":"Weirdly specific but ok. I'll do it.","stage":5,"close":true}]
],
"max_stage":5
},
{
"npc_id":3,
"texts":["*You see a very beautiful woman leaving flowers at a gravestone, you wanna approach her but suddenly, a green flame starts forming around her and she starts some kind of incantation on top of the gravestone.*",
"*You hide behind another gravestone but as you crouch down, the ground itself seems to try and swallow you.*\nWHO IS THERE? STOP HIDING LIKE A RAT AND SHOW YOUR FACE.",
"Oh? So the little rodent knows my name? Stand up, stop squirming around, it was just a little sand.",
"Some old man sent you, huh? Well, you found her. What's your business with her?",
"Oh, you have attitude now? I can bury you back again with the snap of my fingers. But I guess I won't. What do you need?",
"Did he really say that? Well, that means YOU, my little soldier boy, are the fabled hero of Mogdrogen's prophecy. Congrats!",
"Listen, you help me out and I'll do the same for you. You wanna get information, you gotta work for it. Sounds fair?",
"Ha ha, curiosity killed the cat. Some of the dead bodies caught life and ran away since the Mist outbreak. Since you aren't affected by it, you'll go bury those zombies back where they came from.",
"Uh uh, that's extra info and you haven't even earned the first part. Happy hunting.",
"If you're in doubt, remember, dead bodies should be inside the ground, not outside running.",
"Hey, you actually pulled this through. And you're barely scratched. You might be more than meets the eye, I'm impressed. Looks like Morrighan was right afterall."
],
"answers":[[{"text":"...","stage":1,"close":false}],
[{"text":"PLEASE DON'T HURT ME! SOME OLD MAN SENT ME HERE, SAID TO ASK FOR FRAYA! DON'T BURY ME PLEASE!","stage":2,"close":false}],
[{"text":"I'm sorry for sneaking around. Won't happen again, promise.","stage":3,"close":false},{"text":"What the hell were you doing?","stage":4,"close":false}],
[{"text":"He told me to tell you that 'the dove broke its wings'. I have no idea what this means but he said you'll get it.","stage":5,"close":false}],
[{"text":"He told me to tell you that 'the dove broke its wings'. I have no idea what this means but he said you'll get it.","stage":5,"close":false}],
[{"text":"I'm sorry, I'm what now? Is everyone on this island a lunatic?","stage":6,"close":false},{"text":"Prophecy of who?","stage":6,"close":false}],
[{"text":"It seems to me both these things suit you, but I guess I'm a bit intrigued.","stage":7,"close":false},{"text":"I don't really care about your stories, give me a minute to think about your offer.","stage":6,"close":true}],
[{"text":"Sounds fair enough... Wait, what do you mean I am not affected? Why is that?","stage":8,"close":false}],
[{"text":"......I guess......","stage":9,"close":true}],
[{"text":"Very helpful.","stage":9,"close":true}],
[{"text":"Do you always speak in code?","stage":10,"close":false}]
],
"max_stage":10
},
{
"npc_id":3,
"texts":["So? How did it go?",
"Lovely, lovely. Well, I guess I'm due some explanations then. What should I start off with? Hmm...",
"Mogdrogen. Prophecy of Modgrogen. He is the Witch God, and I so happen to be his oracle. He is known to read the future of his followers to them, and he has not been wrong yet.",
"Yes, I am a witch, obviously. It wasn't a trick. Can we move on, now?",
"Well I, as his oracle, am bound to know the future of me and my tribe and so, I am responsible for the wellbeing of my tribe. His last prophecy is as far from good as possible. And let's just say it all depends on you.",
"The prophecy reads: 'When Manahan, the God of Envy decides he can't cope with the hate he has for his sister, Morrighan, Goddess of Purity, he will infect Khali, Morrighan's Holy Ground, with Dullahan's own God-Sealer to corner Morrighan and render her powerless, hidden among the townsfolk, and then will use his power to destroy the island, and inherently, the witch tribe living on it.",
"What Manahan cannot predict is that a warrior risen from 'the World of Those Greedy and Selfish' will make the supreme sacrifice to protect the Goddess and all she stands for by defeating the God of Envy and reclaiming the Holy Ground in the name of Morrighan.",
"Are you daft? YOU are the warrior from 'the World of Those Greedy and Selfish'! The human world! Morrighan has guided you to me because she knew you were the one.",
"Morrighan, through the soul of the people residing in the village, has guided you to me. You know what? Go to the village. Ask Largo, or 'that old man' as you call him, about Morrighan and Manahan if you wanna know more. He's the town wise, I'm just a witch, he's bound to know more than me.",
"Well, first things first. This island is inhabited and protected by a God named Morrighan. She was gifted this island by her father, Dullahan, and her brother, Manahan, was so envious on her, that he started to hate her.",
" Well recently, he stole a weapon from his father's arsenal, the God-Sealer, to release a poisonous gas that will prevent Morrighan from travelling across the island.",
"Look, I'm trying my best and you keep using your little soldier brain to make fun of what I say. How about you go talk to Largo, the old man that sent you here? He is the town wise and also I'm done with your attitude for the time being.",
"Look, just go and ask Largo about this, the old man that sent you here. He is the town wise and knows a lot more about these local affairs."
],
"answers":[[{"text":"They're dead. Deader, I guess. They're definitely not walking around anymore.","stage":1,"close":false}],
[{"text":"How about the 'prophecy of WhatsHisName'?","stage":2,"close":false},{"text":"Start with the Mist. And the reason everyone is crying about it.","stage":9,"close":false}],
[{"text":"Witch God, and you're his oracle. So that makes you a witch, right? That's why you could move the ground around me, right?","stage":3,"close":false},{"text":"...","stage":4,"close":false}],
[{"text":"My bad. Go on.","stage":4,"close":false}],
[{"text":"What was the prophecy?","stage":5,"close":false}],
[{"text":"...","stage":6,"close":false}],
[{"text":"Ok, so where do I come in?","stage":7,"close":false},{"text":"Oh...","stage":8,"close":false}],
[{"text":"Oh...","stage":8,"close":false}],
[{"text":"I guess I'll do just that.","stage":8,"close":true}],
[{"text":"...","stage":10,"close":false}],
[{"text":"That sounds pretty far fetched. You got any other, you know, LOGICAL explanation?","stage":11,"close":false},{"text":"Sounds kind of hard to believe, sorry.","stage":12,"close":false}],
[{"text":"Whatever.","stage":12,"close":true}],
[{"text":"I'll go ask Largo then.","stage":12,"close":true}]
],
"max_stage":12
},
{
"npc_id":1,
"texts":["You're back. I assume Fraya got the message?",
"Did she really? Well, I'd love to chat with you, but your superiors sent a sentry after you. And since they couldn't find you where you were supposed to be, they asked me to give you this message.",
"'Every unit must be at the rendez-vous at Khali beach A.S.A.P. This is a direct order from General Eisenhower.' Captain C. Marshall.",
"So are you in trouble or not?"
],
"answers":[[{"text":"She got the message. She also left you in charge of many, many unanswered questions.","stage":1,"close":false}],
[{"text":"Oh god, am I in trouble? You're the one who sent me to that witch...","stage":2,"close":false}],
[{"text":"Seems like I'll ask the questions later. I gotta go.","stage":3,"close":false}],
[{"text":"I'll find out soon.","stage":3,"close":true}]
],
"max_stage":3
},
{
"npc_id":4,
"texts":["Soldier! Where have you been? I've been informed you were not at your supposed location.",
"Have you...drunk sake soldier? You smell an awful lot like sake.",
"It matters not right now. Go in formation. We'll talk about this incident later. I'll make sure we do.",
"Warriors. We have been dispatched here by the General himself. He knows the duties he has towards the islands under the king's jurisdiction and you better damn know them as well.",
"There is a plague around this island that affects the animals and people alike. We do not know the reason it appeared, nor what it is exactly. All we know is the village is safe and the fields are not. Our job is to make sure the fields are safe as well.",
"On my signal, we charge the beasts infecting the park to the west. Anyone has any questions?",
"THEN GET OUT THERE. TIME TO TEACH THESE MONSTROSITIES A LESSON.",
"What are you waiting for, soldier? The orders are clear. Eliminate the threat at the park to the west of the beach. Dismissed.",
"Good job soldiers. You made short work of those creatures. Today we leave here victorious. Everyone, dismissed.",
"You. The one from earlier. Care to explain to me once again why you were chasing 'witches' at the cemetery while smelling of sake? I'll make sure the quartermaster hears about this. Meanwhile, why don't you go back to the 'town wise' and run chores for him a bit more? Maybe it'll wake you up. Dismissed.",
"No more talking back. You misbehaved enough. Now go before I send you back to the bootcamp."
],
"answers":[[{"text":"I was helping the townsfolk as asked, sir. The town wise asked me to deliver a message to some witch at the cemetery.","stage":1,"close":false}],
[{"text":"I smell like what sir? I assure you, I haven't touched any beverage way before deployment sir.","stage":2,"close":false}],
[{"text":"Sir...sir yes sir.","stage":3,"close":false}],
[{"text":"'SIR YES SIR'","stage":4,"close":false}],
[{"text":"'SIR YES SIR'","stage":5,"close":false}],
[{"text":"'SIR NO SIR'","stage":6,"close":false}],
[{"text":"'SIR YES SIR!!'","stage":7,"close":true}],
[{"text":"Sir yes sir.","stage":7,"close":true}],
[{"text":"*Loud cheers by the whole platoon*","stage":9,"close":false}],
[{"text":"Sir......","stage":10,"close":false}],
[{"text":"Sir yes sir...","stage":10,"close":true}]
],
"max_stage":10
},
{
"npc_id":1,
"texts":["Ha ha, I knew you would be back. You can't avoid destiny, my soldier friend.",
"Hm? You mean the quarrel with the captain? I guess he just wanted to make sure our village is safe, ha ha.",
"Oh, you're right, you didn't, I just uhh... I guessed? Well, truth is, the Goddess herself used her powers to make sure you fulfill your destiny.",
"That is correct, yes. I am glad we are on the same page.",
"No, please, don't get this wrong. The goddess depends on your heroism and selflessness to overcome her evil brother. It is still your choice afterall.",
"Well, I guess I do owe you some answers. Afterall, you are the one that must fulfill the prophecy. What do I start with?",
"Where do I start...Many epochs ago, Dullahan, God of the Defenders, gave 'birth' or whatever you wanna call it, to two children, Manahan was the elder one, God of Envy, and Morrighan was the younger one, Goddess of Purity.",
"Since their childhood, Manahan had the duty to protect his younger sister, even though it sometimes meant he had to sarcrifice his well-being for her sake. But that is what elder brothers are supposed to do, it was his destiny. As they grew older, Manahan started to feel grow tired of his duty and envious of the way everyone treated Morrighan, but he kept going on as her rightful guardian.",
"*Largo sheds a tear* Sometimes, she really regrets she didn't thank Manahan for what he's done, and I think she really loves him. If only envy wouldn't get in the way...",
"No, I wasn't crying!! And well, legends have got to have some truth in them, don't they?"
],
"answers":[[{"text":"Do I smell like sake?","stage":1,"close":false}],
[{"text":"I didn't say anything about the captain though.","stage":2,"close":false}],
[{"text":"So if I was let back to mainland, that would mean I'd never come back here and help her.","stage":3,"close":false},{"text":"Well here I am, so let's get this over with. I got many questions that you'll have to answer.","stage":5,"close":false}],
[{"text":"Well that doesn't sound like destiny at all if a god had to intervene...","stage":4,"close":true}],
[{"text":"And now getting to the main point. How about you explain to me all this gods stuff? Like the brothers and the Mist and whatever else?","stage":5,"close":true}],
[{"text":"The gods.","stage":6,"close":false},{"text":"The Mist.","stage":xxx,"close":false}],
[{"text":"...","stage":7,"close":false}],
[{"text":"...","stage":8,"close":false}],
[{"text":"Are you crying? Is everything ok? You seem a little bit too invested in this story. I'm sure they're just legends.","stage":9,"close":false}]
],
"max_stage":3
}
]