[
{
"npc_id":0,
"texts":["What, someone from the capital came? I thought you forgot abot your damn duties.",
"Look, I'm sorry for what I've said earlier. Just get this thing over with and you can move on with your life.",
"Oh, nothing, it's just that we requestsed aid from the capital god knows how long ago.",
"Our crop fields have been overrun with these weird *things* and no one's brave enough to shoo them away.That's where you come in. Just clear the fields...please.",
"Thank god. You're a life saver. I know this was just another chore for you, but I really wanted to say I appreciate what you've done for us. Also, here's your reward. Farewell!",
"Hey, it's you again. How's it going, hero?"],
"answers":[[{"text":"So what do you want me to do?","stage":3,"close":false},{"text":"How about I came back later when you dropped the attitude?","stage":1,"close":true},{"text":"Did something happen?","stage":2,"close":false}],
[{"text":"So what do you want me to do?","stage":3,"close":false},{"text":"Next time, try with 'please' and 'thank you'.","stage":1,"close":true},{"text":"Did something happen?","stage":2,"close":false}],
[{"text":"I don't see how that's my fault though.","stage":1,"close":false}],
[{"text":"Fair enough.","stage":3,"close":true}],
[{"text":"Eh, I had fun myself.","stage":5,"close":true},{"text":"Glad to see you're relieved.","stage":5,"close":true},{"text":"Whatever.","stage":5,"close":true}],
[{"text":"I'm good, thanks.","stage":5,"close":true}]
],
"max_stage":5
},
{
"npc_id":1,
"texts":["Hey, can you come over here for a second?",
"Please, someone very special to me might be in grave danger. I'm begging you.",
"I will be straight to you kid, I'm very sick. To the point it hurts when I breathe. My last wish is to be next to the only family I got left when my time will come.",
"It's about my daughter. She was supposed to be home by now. She went picnicking with her friend yesterday. I am really, really concerned. Please, look out for her."
],
"answers":[[{"text":"Sure, what will it be?","stage":3,"close":false},{"text":"I'm sorry pops, I'm busy. Royal army stuff.","stage":1,"close":true},{"text":"Why are you speaking so softly? I could barely hear you!","stage":2,"close":false}],
[{"text":"I guess I could help then","stage":3,"close":false},{"text":"I'm sure she's just enjoying the wilderness.What can go wrong in a little picnic?","stage":1,"close":true},{"text":"What happened to your voice again?","stage":2,"close":false}],
[{"text":"Oh...","stage":1,"close":false}],
[{"text":"I'll keep an eye out, go rest for a bit.","stage":3,"close":true}]
],
"max_stage":3
}
]